Revit 2015 API
BuiltInFailures.ConstraintFailures Properties
The BuiltInFailures.ConstraintFailures type exposes the following members.
Properties
Name | Description
UndeletedConstraints
 A Dimension with Lock and/or EQ Constraints is being deleted, but the elements will still be constrained. Push Unconstrain to remove the Constraints or OK to leave elements constrained.
UndeletedConstraintsInGroup
 A labeled dimension is being deleted, but the corresponding constraint belongs to a group and will not be changed. You can change it in group edit mode later.
See Also
BuiltInFailures.ConstraintFailures Class
Autodesk.Revit.DB Namespace